AUTO_config_TK_pesok/src/Catalogs/КоммунальныеУслуги/КоммунальныеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КоммунальныеУслуги</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидКоммунальнойУслуги</name>
    <type>
      <types>EnumRef.ВидыКоммунальныхУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Абонплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифСверхЛимита</name>
    <type>
      <types>CatalogRef.КоммунальныеУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Потребители</name>
    <comment>Потребители коммунальных услуг</comment>
    <attributes>
      <name>Потребитель</name>
      <comment>Потребитель коммунальных услуг</comment>
      <type>
        <types>DefinedType.ПотребительКоммунальныхУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/ТорговыеПлощадки/ТорговыеПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТорговыеПлощадки</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьТоварыПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияОС_ТекущиеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен торговая точка</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>АлкоголемНеТоргуем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешительныеДокументы</name>
    <comment>Наличие разрешительных документов по ПБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСистемаАПС</name>
    <comment>Договор на обслуживание системы АПС</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Потребители</name>
    <comment>Потребители коммунальных услуг</comment>
    <attributes>
      <name>Потребитель</name>
      <comment>Потребитель коммунальных услуг</comment>
      <type>
        <types>DefinedType.ПотребительКоммунальныхУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РекламныеПлоскости</name>
    <attributes>
      <name>Расположение</name>
      <type>
        <types>EnumRef.ПлоскостьПодРекламу</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламныйНоситель</name>
      <type>
        <types>CatalogRef.РекламныеНосители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сюжет</name>
      <type>
        <types>CatalogRef.СюжетыРекламныхНосителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеПоставщиков</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНапитков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Чай</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДверей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВывоза</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Огнетушители</name>
    <attributes>
      <name>Огнетушитель</name>
      <type>
        <types>EnumRef.ТипыОгнетушителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующегоТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/КоммунальныеУслуги/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "ТарифыКоммунальныхУслуг", Объект.Ссылка);
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "АбонплатыКоммунальныхУслуг", Объект.Ссылка);
	Элементы.ГруппаАбонплата.Видимость = Объект.АбонПлата;
	ОформлениеТЧ_Потребители();
КонецПроцедуры

&НаСервере
Процедура ОформлениеТЧ_Потребители();
	Для Каждого строка из Объект.Потребители Цикл
		Потребитель = строка.Потребитель;
		Если ТипЗнч(Потребитель) = Тип("СправочникСсылка.ТорговыеПлощадки") Тогда
			строка.ИндексКартинки = 8;
			строка.Код = Потребитель.Код;
			строка.Контрагент = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(Потребитель, ТекущаяДата()).Контрагент;
		ИначеЕсли ТипЗнч(Потребитель) = Тип("СправочникСсылка.ТочкиДоставки") Тогда
			строка.ИндексКартинки = 5;
			строка.Код = Потребитель.Global_ID;
			строка.Контрагент = Потребитель.Владелец;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура АбонПлатаПриИзменении(Элемент)
	Элементы.ГруппаАбонплата.Видимость = Объект.АбонПлата;
КонецПроцедуры
